; domain
(define (domain Project_TER)
    (:requirements :strips :typing :action-costs :disjunctive-preconditions)
    
    (:types
        loc          ; Fixed warehouse locations/zones
        worker       ; Human operators (caristes)
        fenwick      ; Forklifts / Material handling vehicles
        package      ; Pallets (mono, mixed, or empty targets)
        pallet_type  ; Euro, Half, Non-Euro profiles
    )
    
    (:predicates
        ;; Spatial Positioning
        (at ?obj - object ?l - loc)              ; Track workers, forklifts, packages
        (connected ?l1 - loc ?l2 - loc)          ; Map topology
        
        ;; Vehicle Logistics State
        (worker_mounted ?w - worker ?v - fenwick) ; Worker is driving the forklift
        (carrying ?v - fenwick ?p - package)      ; Package is loaded on the forks
        (forklift_empty ?v - fenwick)             ; Forklift forks are clear
        
        ;; Package Typology & State
        (is_mono ?p - package)                    ; Standard, single-SKU unit load
        (is_mixed ?p - package)                   ; Mixed-SKU unit load requiring sorting
        (contains ?p - package ?item - object)     ; Item batch inside a mixed package
        (empty ?p - package)                      ; Target sorting pallet is empty
        
        ;; PDA & Structural Prep States
        (pda_idle ?w - worker)                    ; Worker device hasn't been booted
        (pda_setup_complete ?w - worker)          ; Worker is authenticated and ready
        (physical_pallet_type ?p - package ?t - pallet_type) ; Assigned profile
        (has_interlayer ?p - package)             ; Stability sheet applied
        
        ;; Processing Pipeline Milestones
        (product_scanned ?p - package)            ; Stage 1: Inbound registration
        (prepared ?p - package)                   ; Stage 2: Quality/Breakdown sorting complete
        (controlled ?p - package)                 ; Stage 3: Compliance & safety checked
        (loaded ?p - package)                     ; Stage 4: Staged inside shipping dock
        
        ;; Zone Layout Definitions
        (is_truck ?l - loc)
        (is_arrival_zone ?l - loc)
        (is_prep_zone ?l - loc)
        (is_control_zone ?l - loc)
        (is_shipping_dock ?l - loc)
        (is_empty_pallet_zone ?l - loc)           ; Storage for raw picking bases
    )
    
    (:functions
        (total-cost)                     ; Metric calculation for planner optimization
    )

    ;; ==========================================
    ;; PDA & PALLET PREPARATION PROCESS
    ;; ==========================================

    ;; Stage 0A: Boot up administrative session on foot in control zone
    (:action pda_initialize_and_setup
        :parameters (?w - worker ?l - loc)
        :precondition (and 
            (at ?w ?l) 
            (is_control_zone ?l) 
            (pda_idle ?w)
        )
        :effect (and 
            (not (pda_idle ?w))
            (pda_setup_complete ?w)
            (increase (total-cost) 2)
        )
    )

    ;; Stage 0B: Define the structure of the target pallet before sorting
    (:action retrieve_empty_pallet_for_picking
        :parameters (?w - worker ?p - package ?t - pallet_type ?l - loc)
        :precondition (and 
            (at ?w ?l) 
            (at ?p ?l)
            (is_empty_pallet_zone ?l)
            (empty ?p)
            (pda_setup_complete ?w)
        )
        :effect (and 
            (physical_pallet_type ?p ?t)
            (increase (total-cost) 5)
        )
    )

    ;; Stage 0C: Layer reinforcement requirement for safety
    (:action apply_interlayer_sheet
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and 
            (at ?w ?l) 
            (at ?p ?l)
            (empty ?p)
            (not (has_interlayer ?p))
            (pda_setup_complete ?w)
        )
        :effect (and 
            (has_interlayer ?p)
            (increase (total-cost) 3)
        )
    )

    ;; ==========================================
    ;; VEHICLE & NAVIGATIONAL ACTIONS
    ;; ==========================================

    (:action walk_on_foot
        :parameters (?w - worker ?from - loc ?to - loc)
        :precondition (and (at ?w ?from) (connected ?from ?to))
        :effect (and 
            (not (at ?w ?from)) 
            (at ?w ?to)
            (increase (total-cost) 10)
        )
    )

    (:action wait_one_timestep
        :parameters (?w - worker ?l - loc)
        :precondition (or (at ?w ?l) (exists (?v - fenwick) (and (worker_mounted ?w ?v) (at ?v ?l))))
        :effect (and (increase (total-cost) 0))
    )

    (:action mount_fenwick
        :parameters (?w - worker ?v - fenwick ?l - loc)
        :precondition (and (at ?w ?l) (at ?v ?l))
        :effect (and 
            (not (at ?w ?l)) 
            (worker_mounted ?w ?v)
            (increase (total-cost) 5)
        )
    )

    (:action dismount_fenwick
        :parameters (?w - worker ?v - fenwick ?l - loc)
        :precondition (and (worker_mounted ?w ?v) (at ?v ?l))
        :effect (and 
            (at ?w ?l) 
            (not (worker_mounted ?w ?v))
            (increase (total-cost) 5)
        )
    )

    (:action drive_fenwick
        :parameters (?w - worker ?v - fenwick ?from - loc ?to - loc)
        :precondition (and (worker_mounted ?w ?v) (at ?v ?from) (connected ?from ?to))
        :effect (and 
            (not (at ?v ?from)) 
            (at ?v ?to)
            (increase (total-cost) 20)
        )
    )

    ;; ==========================================
    ;; PHYSICAL PALLET HANDLING
    ;; ==========================================

    (:action load_forklift
        :parameters (?w - worker ?v - fenwick ?p - package ?l - loc)
        :precondition (and (worker_mounted ?w ?v) (at ?v ?l) (at ?p ?l) (forklift_empty ?v))
        :effect (and 
            (not (at ?p ?l)) 
            (carrying ?v ?p) 
            (not (forklift_empty ?v))
            (increase (total-cost) 5)
        )
    )

    (:action unload_forklift
        :parameters (?w - worker ?v - fenwick ?p - package ?l - loc)
        :precondition (and (worker_mounted ?w ?v) (at ?v ?l) (carrying ?v ?p))
        :effect (and 
            (at ?p ?l) 
            (not (carrying ?v ?p)) 
            (forklift_empty ?v)
            (increase (total-cost) 5)
        )
    )

    ;; ==========================================
    ;; CORE WAREHOUSE PROCESSING PIPELINE
    ;; ==========================================

    (:action scan_product
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and 
            (at ?p ?l)
            (pda_setup_complete ?w)
            (or (at ?w ?l) 
                (exists (?v - fenwick) (and (worker_mounted ?w ?v) (at ?v ?l))))
        )
        :effect (and 
            (product_scanned ?p)
            (increase (total-cost) 1)
        )
    )

    (:action sort_into_new_palette
        :parameters (?w - worker ?mixed_pal - package ?item - object ?target_pal - package ?l - loc)
        :precondition (and 
            (at ?w ?l) (at ?mixed_pal ?l) (at ?target_pal ?l)
            (is_mixed ?mixed_pal) 
            (contains ?mixed_pal ?item) 
            (empty ?target_pal)
            (has_interlayer ?target_pal)
            (pda_setup_complete ?w)
            (is_arrival_zone ?l)
        )
        :effect (and 
            (not (contains ?mixed_pal ?item))
            (not (empty ?target_pal))
            (is_mono ?target_pal)
            (increase (total-cost) 15)
        )
    )

    (:action mark_prepared
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and 
            (at ?p ?l) (product_scanned ?p) (is_mono ?p) (is_prep_zone ?l)
            (pda_setup_complete ?w)
            (or (at ?w ?l) 
                (exists (?v - fenwick) (and (worker_mounted ?w ?v) (at ?v ?l))))
        )
        :effect (and 
            (prepared ?p)
            (increase (total-cost) 2)
        )
    )

    (:action mark_controlled
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and 
            (at ?p ?l) (prepared ?p) (is_control_zone ?l)
            (pda_setup_complete ?w)
            (or (at ?w ?l) 
                (exists (?v - fenwick) (and (worker_mounted ?w ?v) (at ?v ?l))))
        )
        :effect (and 
            (controlled ?p)
            (increase (total-cost) 2)
        )
    )

    (:action mark_loaded
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and 
            (at ?p ?l) (controlled ?p) (is_shipping_dock ?l)
            (pda_setup_complete ?w)
            (or (at ?w ?l) 
                (exists (?v - fenwick) (and (worker_mounted ?w ?v) (at ?v ?l))))
        )
        :effect (and 
            (loaded ?p)
            (increase (total-cost) 2)
        )
    )
)

; problem
(define (problem TER_warehouse_instance_1)
    (:domain Project_TER)
    
    (:objects
        ;; Locations / Topology Nodes
        loc_truck loc_arrival loc_empty_pallets loc_prep loc_control loc_shipping - loc
        
        ;; Agents & Logistics Fleet
        cariste_1 - worker
        fenwick_1 - fenwick
        
        ;; Pallets & Stock Items
        mixed_pallet_01 target_pallet_01 - package
        item_batch_A - object
        
        ;; Structural Attributes
        euro_profile - pallet_type
    )
    
    (:init
        ;; Topology Connectivity Map
        (connected loc_truck loc_arrival)
        (connected loc_arrival loc_truck)
        (connected loc_arrival loc_empty_pallets)
        (connected loc_empty_pallets loc_arrival)
        (connected loc_arrival loc_prep)
        (connected loc_prep loc_arrival)
        (connected loc_prep loc_control)
        (connected loc_control loc_prep)
        (connected loc_control loc_shipping)
        (connected loc_shipping loc_control)
        
        ;; Functional Zone Definitions
        (is_truck loc_truck)
        (is_arrival_zone loc_arrival)
        (is_empty_pallet_zone loc_empty_pallets)
        (is_prep_zone loc_prep)
        (is_control_zone loc_control)
        (is_shipping_dock loc_shipping)
        
        ;; Fleet & Operator Initialization
        (at cariste_1 loc_control)         ; Worker begins on foot in control zone to log in
        (pda_idle cariste_1)               ; Device needs authentication
        
        (at fenwick_1 loc_arrival)         ; Forklift parked at arrival docks
        (forklift_empty fenwick_1)
        
        ;; Inbound Cargo State
        (at mixed_pallet_01 loc_arrival)
        (is_mixed mixed_pallet_01)
        (contains mixed_pallet_01 item_batch_A)
        
        ;; Target/Picking Base State
        (at target_pallet_01 loc_empty_pallets)
        (empty target_pallet_01)           ; Raw, clean structure awaiting configuration
        
        ;; Metric Calculation Start Hook
        (= (total-cost) 0)
    )
    
    (:goal
        (and
            ;; Verify the pipeline execution reached fulfillment
            (loaded target_pallet_01)
            
            ;; Verify the target inventory allocation was fully transferred
            (is_mono target_pallet_01)
            (not (contains mixed_pallet_01 item_batch_A))
            
            ;; Clean up step: Ensure equipment is parked safely inside the terminal docks
            (at fenwick_1 loc_shipping)
            (forklift_empty fenwick_1)
        )
    )
    
    (:metric minimize (total-cost))
)

; plan
1. (pda_initialize_and_setup cariste_1 loc_control)
   deleted: (pda_idle cariste_1)
   added: (pda_setup_complete cariste_1)
   goals met: 1 of 5
2. (walk_on_foot cariste_1 loc_control loc_prep)
   deleted: (at cariste_1 loc_control)
   added: (at cariste_1 loc_prep)
   goals met: 1 of 5
3. (walk_on_foot cariste_1 loc_prep loc_arrival)
   deleted: (at cariste_1 loc_prep)
   added: (at cariste_1 loc_arrival)
   goals met: 1 of 5
4. (mount_fenwick cariste_1 fenwick_1 loc_arrival)
   deleted: (at cariste_1 loc_arrival)
   added: (worker_mounted cariste_1 fenwick_1)
   goals met: 1 of 5
5. (drive_fenwick cariste_1 fenwick_1 loc_arrival loc_empty_pallets)
   deleted: (at fenwick_1 loc_arrival)
   added: (at fenwick_1 loc_empty_pallets)
   goals met: 1 of 5
6. (load_forklift cariste_1 fenwick_1 target_pallet_01 loc_empty_pallets)
   deleted: (at target_pallet_01 loc_empty_pallets) (forklift_empty fenwick_1)
   added: (carrying fenwick_1 target_pallet_01)
   goals met: 0 of 5
7. (drive_fenwick cariste_1 fenwick_1 loc_empty_pallets loc_arrival)
   deleted: (at fenwick_1 loc_empty_pallets)
   added: (at fenwick_1 loc_arrival)
   goals met: 0 of 5
8. (unload_forklift cariste_1 fenwick_1 target_pallet_01 loc_arrival)
   deleted: (carrying fenwick_1 target_pallet_01)
   added: (at target_pallet_01 loc_arrival) (forklift_empty fenwick_1)
   goals met: 1 of 5
9. (dismount_fenwick cariste_1 fenwick_1 loc_arrival)
   deleted: (worker_mounted cariste_1 fenwick_1)
   added: (at cariste_1 loc_arrival)
   goals met: 1 of 5
10. (apply_interlayer_sheet cariste_1 target_pallet_01 loc_arrival)
   added: (has_interlayer target_pallet_01)
   goals met: 1 of 5
11. (scan_product cariste_1 target_pallet_01 loc_arrival)
   added: (product_scanned target_pallet_01)
   goals met: 1 of 5
12. (sort_into_new_palette cariste_1 mixed_pallet_01 item_batch_a target_pallet_01 loc_arrival)
   deleted: (contains mixed_pallet_01 item_batch_a) (empty target_pallet_01)
   added: (is_mono target_pallet_01)
   goals met: 3 of 5
13. (mount_fenwick cariste_1 fenwick_1 loc_arrival)
   deleted: (at cariste_1 loc_arrival)
   added: (worker_mounted cariste_1 fenwick_1)
   goals met: 3 of 5
14. (load_forklift cariste_1 fenwick_1 target_pallet_01 loc_arrival)
   deleted: (at target_pallet_01 loc_arrival) (forklift_empty fenwick_1)
   added: (carrying fenwick_1 target_pallet_01)
   goals met: 2 of 5
15. (drive_fenwick cariste_1 fenwick_1 loc_arrival loc_prep)
   deleted: (at fenwick_1 loc_arrival)
   added: (at fenwick_1 loc_prep)
   goals met: 2 of 5
16. (unload_forklift cariste_1 fenwick_1 target_pallet_01 loc_prep)
   deleted: (carrying fenwick_1 target_pallet_01)
   added: (at target_pallet_01 loc_prep) (forklift_empty fenwick_1)
   goals met: 3 of 5
17. (mark_prepared cariste_1 target_pallet_01 loc_prep)
   added: (prepared target_pallet_01)
   goals met: 3 of 5
18. (load_forklift cariste_1 fenwick_1 target_pallet_01 loc_prep)
   deleted: (at target_pallet_01 loc_prep) (forklift_empty fenwick_1)
   added: (carrying fenwick_1 target_pallet_01)
   goals met: 2 of 5
19. (drive_fenwick cariste_1 fenwick_1 loc_prep loc_control)
   deleted: (at fenwick_1 loc_prep)
   added: (at fenwick_1 loc_control)
   goals met: 2 of 5
20. (unload_forklift cariste_1 fenwick_1 target_pallet_01 loc_control)
   deleted: (carrying fenwick_1 target_pallet_01)
   added: (at target_pallet_01 loc_control) (forklift_empty fenwick_1)
   goals met: 3 of 5
21. (dismount_fenwick cariste_1 fenwick_1 loc_control)
   deleted: (worker_mounted cariste_1 fenwick_1)
   added: (at cariste_1 loc_control)
   goals met: 3 of 5
22. (mark_controlled cariste_1 target_pallet_01 loc_control)
   added: (controlled target_pallet_01)
   goals met: 3 of 5
23. (mount_fenwick cariste_1 fenwick_1 loc_control)
   deleted: (at cariste_1 loc_control)
   added: (worker_mounted cariste_1 fenwick_1)
   goals met: 3 of 5
24. (load_forklift cariste_1 fenwick_1 target_pallet_01 loc_control)
   deleted: (at target_pallet_01 loc_control) (forklift_empty fenwick_1)
   added: (carrying fenwick_1 target_pallet_01)
   goals met: 2 of 5
25. (drive_fenwick cariste_1 fenwick_1 loc_control loc_shipping)
   deleted: (at fenwick_1 loc_control)
   added: (at fenwick_1 loc_shipping)
   goals met: 3 of 5
26. (unload_forklift cariste_1 fenwick_1 target_pallet_01 loc_shipping)
   deleted: (carrying fenwick_1 target_pallet_01)
   added: (at target_pallet_01 loc_shipping) (forklift_empty fenwick_1)
   goals met: 4 of 5
27. (mark_loaded cariste_1 target_pallet_01 loc_shipping)
   added: (loaded target_pallet_01)
   goals met: 5 of 5
